# Sheet 3

In [2]:
#13 Feb
import pandas as pd
data_table = pd.DataFrame({'Name':['Sathish','Mary','John'], 'Age':[23,31,20]})

In [3]:
data_table

,Name,Age
0,Sathish,23
1,Mary,31
2,John,20

In [4]:
data_table["Age"]

In [5]:
import numpy as np
arr = np.array([2,5,7,4,1,9,5,2,6]).reshape(3,3,)
arr

In [8]:
table2 = pd.DataFrame(arr,columns=["D1","D2","D3"])

In [9]:
table2.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['D1', 'D2', 'D3'], dtype='object')]

In [10]:
table2.shape

(3, 3)

In [11]:
table2.ndim

2

In [12]:
table2.size

9

In [13]:
table2.columns

Index(['D1', 'D2', 'D3'], dtype='object')

In [14]:
table2.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
table2.columns = ("Col1","Col2","Col3")
table2

,Col1,Col2,Col3
0,2,5,7
1,4,1,9
2,5,2,6

In [16]:
table2.iloc[0]

In [19]:
table2.iloc[[0,1],2]

In [22]:
table2["Col2"][0]

5

In [23]:
table2.set_index("Col1",inplace = True)
table2

,Col2,Col3
Col1,,
2,5,7
4,1,9
5,2,6

In [25]:
table2.reset_index(inplace=True)
table2

,index,Col1,Col2,Col3
0,0,2,5,7
1,1,4,1,9
2,2,5,2,6

In [26]:
table2.sort_index(inplace=True)
table2

,index,Col1,Col2,Col3
0,0,2,5,7
1,1,4,1,9
2,2,5,2,6

In [27]:
emp = pd.DataFrame({"Name":["John","Mike","Loki","Steve"],
                    "Dep":["IT","HR","Finance","Manager"],
                    "Income":[44543,245432,234524,34534],
                    "Age":[23,34,21,41]})
emp

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41

In [28]:
emp["Dep"] == "IT"

In [30]:
varit = emp["Dep"] == "IT"
emp[varit]

,Name,Dep,Income,Age
0,John,IT,44543,23

In [32]:
emp[emp["Income"]>34578]

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21

In [35]:
emp[(emp["Age"]>30) | (emp["Income"]>223322)]

,Name,Dep,Income,Age
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41

In [36]:
emp[(~emp["Age"]>30) | (emp["Income"]>223322)]

,Name,Dep,Income,Age
1,Mike,HR,245432,34
2,Loki,Finance,234524,21

In [39]:
emp.append({"Name":"Vetri","Dep":"Software","Income":53453,"Age":27},ignore_index=True)

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41
4,Vetri,Software,53453,27

In [40]:
emp.drop(index=2)

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
3,Steve,Manager,34534,41

In [43]:
emp["Exp"] = [2,3,7,1]
emp

,Name,Dep,Income,Age,Exp
0,John,IT,44543,23,2
1,Mike,HR,245432,34,3
2,Loki,Finance,234524,21,7
3,Steve,Manager,34534,41,1

In [44]:
emp.drop(columns=["Exp"])

,Name,Dep,Income,Age
0,John,IT,44543,23
1,Mike,HR,245432,34
2,Loki,Finance,234524,21
3,Steve,Manager,34534,41